- head(n): returns the first n rows from the DataFrame as a list of Row Objects.
- first(): returns the very first row of the DataFrame as a Row Objects.
- tail(n): returns the last n rows form the DataFrame as a list of Row Objects.

In [3]:
from pyspark.sql import SparkSession
spark = SparkSession.builder.appName("PySparkHeadTailFirst").getOrCreate()

WARNING: Using incubator modules: jdk.incubator.vector
Using Spark's default log4j profile: org/apache/spark/log4j2-defaults.properties
25/09/08 09:32:09 WARN Utils: Your hostname, KLZPC0015, resolves to a loopback address: 127.0.1.1; using 172.25.17.96 instead (on interface eth0)
25/09/08 09:32:09 WARN Utils: Set SPARK_LOCAL_IP if you need to bind to another address
Using Spark's default log4j profile: org/apache/spark/log4j2-defaults.properties
Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
25/09/08 09:32:20 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable
25/09/08 09:32:22 WARN Utils: Service 'SparkUI' could not bind on port 4040. Attempting port 4041.
25/09/08 09:32:22 WARN Utils: Service 'SparkUI' could not bind on port 4041. Attempting port 4042.
25/09/08 09:32:22 WARN Utils: Service 'SparkUI' could not bind on port 4042. Attempting port 4043.

In [4]:
# create sample dataframes
data = [
    (1, "Manta", 75000, "IT", 24),
    (2, "Dipankar", 30000, "Post Master", 27),
    (3, "Souvik", 60000, "Army Officer", 27),
    (4, "Soukarjya", 45000, "BDO", None),
    (5, "Arvind", 35000, "Business Analyst", 28),
    (6, "Prodipta", 25000, "Data Analyst", 28),
    (7, "Padma", 20000, "Data Analyst", 27),
    (8, "Panta", 125000, "Business Analyst", 27),
    (9, "Sougato", 25000, "IT", 29)
]

columns = ["id", "name", "salary", "department", "age"]

df = spark.createDataFrame(data, schema=columns)
df.show()

+---+---------+------+----------------+----+
| id|     name|salary|      department| age|
+---+---------+------+----------------+----+
|  1|    Manta| 75000|              IT|  24|
|  2| Dipankar| 30000|     Post Master|  27|
|  3|   Souvik| 60000|    Army Officer|  27|
|  4|Soukarjya| 45000|             BDO|NULL|
|  5|   Arvind| 35000|Business Analyst|  28|
|  6| Prodipta| 25000|    Data Analyst|  28|
|  7|    Padma| 20000|    Data Analyst|  27|
|  8|    Panta|125000|Business Analyst|  27|
|  9|  Sougato| 25000|              IT|  29|
+---+---------+------+----------------+----+

In [ ]:
# head() - returns the first n rows as a list of row objects
print("Using head(3): ")
head_rows = df.head(3)
for row in head_rows:
    print(row)

Using head(3):

Row(id=1, name='Manta', salary=75000, department='IT', age=24)
Row(id=2, name='Dipankar', salary=30000, department='Post Master', age=27)
Row(id=3, name='Souvik', salary=60000, department='Army Officer', age=27)

In [6]:
# first() - returns the first row as a row object
print("Using first():")
first_row = df.first()
print(first_row)

Using first():

Row(id=1, name='Manta', salary=75000, department='IT', age=24)

In [8]:
# print in table format

# print header 
print(f"{"name": <20} {'department': <15} {'salary': <10}")

# print separator
print("-" * 50)

# print row values
print(f"{first_row['name']: <20} { first_row['department']: <15} {first_row['salary']: <10}")

name                 department      salary
--------------------------------------------------
Manta                IT              75000

In [9]:
# tail() - returns the last n rows as a list of row objects
print("Using tail(2): ")
tail_rows = df.tail(2)
for row in tail_rows:
    print(row)

Using tail(2):

Row(id=8, name='Panta', salary=125000, department='Business Analyst', age=27)
Row(id=9, name='Sougato', salary=25000, department='IT', age=29)